app/controllers/home_controller.rb

SELECT COUNT(*) FROM "particles"
SELECT  "firsts".* FROM "firsts"   ORDER BY "firsts"."id" ASC LIMIT 1 OFFSET 5
SELECT  "particles".* FROM "particles"   ORDER BY "particles"."id" ASC LIMIT 1 OFFSET 2
---
  def set_particle(adj, noun)
    if  noun.is_proper
      particle = ''
    else
      num_particles = Particle.count
      particle = Particle.limit(1).offset(rand(num_particles)).first.value